2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_i2c_inline.h
  if (NewState != DISABLE) {
    /* Enable General Call */
    I2C->CR1 |= I2C_CR1_ENGC;
  } else /* NewState == DISABLE */
  {
    /* Disable General Call */
    I2C->CR1 &= (uint8_t)(~I2C_CR1_ENGC);
  }
}

/**
 * @brief  Generates I2C communication START condition.
 * @note   CCR must be programmed, i.e. I2C_Init function must have been called
 *         with a valid I2C_ClockSpeed
 * @param  NewState : Enable or disable the start condition.
 *         This parameter can be any of the @ref FunctionalState enumeration.
 * @retval None
 */
inline void I2C_GenerateSTART_inline(FunctionalState NewState) {
  /* Check function parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    /* Generate a START condition */
    I2C->CR2 |= I2C_CR2_START;
  } else /* NewState == DISABLE */
  {
    /* Disable the START condition generation */
    I2C->CR2 &= (uint8_t)(~I2C_CR2_START);
  }
}

/**
 * @brief  Generates I2C communication STOP condition.
 * @param   NewState : Enable or disable the stop condition.
 *          This parameter can be any of the @ref FunctionalState enumeration.
 * @retval None
 */
inline void I2C_GenerateSTOP_inline(FunctionalState NewState) {
  /* Check function parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    /* Generate a STOP condition */
    I2C->CR2 |= I2C_CR2_STOP;
  } else /* NewState == DISABLE */
  {
    /* Disable the STOP condition generation */
    I2C->CR2 &= (uint8_t)(~I2C_CR2_STOP);
  }
}

/**
 * @brief  Enables or disables I2C software reset.
 * @param  NewState : Specifies the new state of the I2C software reset.
 *         This parameter can be any of the @ref FunctionalState enumeration.
 * @retval None
 */
inline void I2C_SoftwareResetCmd_inline(FunctionalState NewState) {
  /* Check function parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    /* Peripheral under reset */
    I2C->CR2 |= I2C_CR2_SWRST;
  } else /* NewState == DISABLE */
  {
    /* Peripheral not under reset */
    I2C->CR2 &= (uint8_t)(~I2C_CR2_SWRST);
  }
}

/**
 * @brief  Enables or disables the I2C clock stretching.
 * @param  NewState : Specifies the new state of the I2C Clock stretching.
 *         This parameter can be any of the @ref FunctionalState enumeration.
 * @retval None
 */
inline void I2C_StretchClockCmd_inline(FunctionalState NewState) {
  /* Check function parameters */
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    /* Clock Stretching Enable */
    I2C->CR1 &= (uint8_t)(~I2C_CR1_NOSTRETCH);

  } else /* NewState == DISABLE */
  {
    /* Clock Stretching Disable (Slave mode) */
    I2C->CR1 |= I2C_CR1_NOSTRETCH;
  }
}

/**
 * @brief  Enable or Disable the I2C acknowledge and position acknowledge
 * feature.
 * @note   This function must be called before data reception start
 * @param  Ack : Specifies the acknowledge mode to apply.
 *         This parameter can be any of the  @ref I2C_Ack_TypeDef enumeration.
 * @retval None
 */
inline void I2C_AcknowledgeConfig_inline(I2C_Ack_TypeDef Ack) {
  /* Check function parameters */
  assert_param(IS_I2C_ACK_OK(Ack));

  if (Ack == I2C_ACK_NONE) {
    /* Disable the acknowledgement */
    I2C->CR2 &= (uint8_t)(~I2C_CR2_ACK);
  } else {
    /* Enable the acknowledgement */
    I2C->CR2 |= I2C_CR2_ACK;

    if (Ack == I2C_ACK_CURR) {
      /* Configure (N)ACK on current byte */
      I2C->CR2 &= (uint8_t)(~I2C_CR2_POS);
    } else {
      /* Configure (N)ACK on next byte */
      I2C->CR2 |= I2C_CR2_POS;
    }
  }
}

/**
 * @brief  Enables or disables the specified I2C interrupt.
 * @param  I2C_IT : Name of the interrupt to enable or disable.
 *         This parameter can be any of the  @ref I2C_IT_TypeDef enumeration.
 * @param  NewState : State of the interrupt to apply.
 *         This parameter can be any of the @ref FunctionalState enumeration.
 * @retval None
 */
inline void I2C_ITConfig_inline(I2C_IT_TypeDef I2C_IT,
                                FunctionalState NewState) {
  /* Check functions parameters */
  assert_param(IS_I2C_INTERRUPT_OK(I2C_IT));
  assert_param(IS_FUNCTIONALSTATE_OK(NewState));

  if (NewState != DISABLE) {
    /* Enable the selected I2C interrupts */
    I2C->ITR |= (uint8_t)I2C_IT;
  } else /* NewState == DISABLE */
  {
    /* Disable the selected I2C interrupts */
    I2C->ITR &= (uint8_t)(~(uint8_t)I2C_IT);
  }
}

/**
 * @brief  Selects the specified I2C fast mode duty cycle.
 * @param  I2C_DutyCycle : Specifies the duty cycle to apply.
 *         This parameter can be any of the @ref I2C_DutyCycle_TypeDef
 * enumeration.
 * @retval None
 */
inline void
I2C_FastModeDutyCycleConfig_inline(I2C_DutyCycle_TypeDef I2C_DutyCycle) {
  /* Check function parameters */
  assert_param(IS_I2C_DUTYCYCLE_OK(I2C_DutyCycle));

  if (I2C_DutyCycle == I2C_DUTYCYCLE_16_9) {
    /* I2C fast mode Tlow/Thigh = 16/9 */
    I2C->CCRH |= I2C_CCRH_DUTY;
  } else /* I2C_DUTYCYCLE_2 */
  {
    /* I2C fast mode Tlow/Thigh = 2 */
    I2C->CCRH &= (uint8_t)(~I2C_CCRH_DUTY);
  }
}

/**
 * @brief  Returns the most recent received data.
 * @param  None
 * @retval uint8_t : The value of the received byte data.
 */
inline uint8_t I2C_ReceiveData_inline(void) {
  /* Return the data present in the DR register */
  return ((uint8_t)I2C->DR);
}

/**
 * @brief  Transmits the 7-bit address (to select the) slave device.
 * @param   Address : Specifies the slave address which will be transmitted.
 * @param   Direction : Specifies whether the I2C device will be a Transmitter
 * or a Receiver. This parameter can be any of the @ref I2C_Direction_TypeDef
 * enumeration.
 * @retval None
 */
inline void I2C_Send7bitAddress_inline(uint8_t Address,
                                       I2C_Direction_TypeDef Direction) {
  /* Check function parameters */
  assert_param(IS_I2C_ADDRESS_OK(Address));
  assert_param(IS_I2C_DIRECTION_OK(Direction));

  /* Clear bit0 (direction) just in case */
  Address &= (uint8_t)0xFE;

  /* Send the Address + Direction */
  I2C->DR = (uint8_t)(Address | (uint8_t)Direction);
}

/**
 * @brief  Send a byte by writing in the DR register.
 * @param   Data : Byte to be sent.
 * @retval None
 */
inline void I2C_SendData_inline(uint8_t Data) {
  /* Write in the DR register the data to be sent */
  I2C->DR = Data;
}

/**
 * @brief
 ****************************************************************************************
 *
 *                         I2C State Monitoring Functions
 *
 ****************************************************************************************
 * This I2C driver provides three different ways for I2C state monitoring
 *  depending on the application requirements and constraints:
 *
 *
 * 1) Basic state monitoring:
 *    Using I2C_CheckEvent() function:
 *    It compares the status registers (SR1, SR2 and SR3) content to a given
 * event (can be the combination of one or more flags). It returns SUCCESS if
 * the current status includes the given flags and returns ERROR if one or more
 * flags are missing in the current status.
 *    - When to use:
 *      - This function is suitable for most applications as well as for startup
 *      activity since the events are fully described in the product reference
 * manual (RM0016).
 *      - It is also suitable for users who need to define their own events.
 *    - Limitations:
 *      - If an error occurs (ie. error flags are set besides to the monitored
 * flags), the I2C_CheckEvent() function may return SUCCESS despite the
 * communication hold or corrupted real state. In this case, it is advised to
 * use error interrupts to monitor the error events and handle them in the
 * interrupt IRQ handler.
 *
 *        @note
 *        For error management, it is advised to use the following functions:
 *          - I2C_ITConfig() to configure and enable the error interrupts
 * (I2C_IT_ERR).
 *          - I2C_IRQHandler() which is called when the I2C interrupts occur.
 *          - I2C_GetFlagStatus() or I2C_GetITStatus() to be called into the
 *           I2C_IRQHandler() function in order to determine which error
 * occurred.
 *          - I2C_ClearFlag() or I2C_ClearITPendingBit() and/or
 * I2C_SoftwareResetCmd() and/or I2C_GenerateStop() in order to clear the error
 * flag and source and return to correct communication status.
 *
 *
 *  2) Advanced state monitoring:
 *     Using the function I2C_GetLastEvent() which returns the image of both SR1
 *     & SR3 status registers in a single word (uint16_t) (Status Register 3
 * value is shifted left by 8 bits and concatenated to Status Register 1).
 *     - When to use:
 *       - This function is suitable for the same applications above but it
 * allows to overcome the limitations of I2C_GetFlagStatus() function (see
 * below). The returned value could be compared to events already defined in the
 *         library (stm8s_i2c.h) or to custom values defined by user.
 *       - This function is suitable when multiple flags are monitored at the
 * same time.
 *       - At the opposite of I2C_CheckEvent() function, this function allows
 * user to choose when an event is accepted (when all events flags are set and
 * no other flags are set or just when the needed flags are set like
 *         I2C_CheckEvent() function).
 *     - Limitations:
 *       - User may need to define his own events.
 *       - Same remark concerning the error management is applicable for this
 *         function if user decides to check only regular communication flags
 * (and ignores error flags).
 *
 *
 *  3) Flag-based state monitoring:
 *     Using the function I2C_GetFlagStatus() which simply returns the status of
 *     one single flag (ie. I2C_FLAG_RXNE ...).
 *     - When to use:
 *        - This function could be used for specific applications or in debug
 * phase.
 *        - It is suitable when only one flag checking is needed (most I2C
 * events are monitored through multiple flags).
 *     - Limitations:
 *        - When calling this function, the Status register is accessed. Some
 * flags are cleared when the status register is accessed. So checking the
 * status of one Flag, may clear other ones.
 *        - Function may need to be called twice or more in order to monitor one
 *          single event.
 *
 *  For detailed description of Events, please refer to section I2C_Events in
 *  stm8s_i2c.h file.
 *
 */
/**
 *
 *  1) Basic state monitoring
 *******************************************************************************
 */

/**
 * @brief  Checks whether the last I2C Event is equal to the one passed
 *   as parameter.
 * @param  I2C_Event: specifies the event to be checked.
 *   This parameter can be one of the following values:
 *     @arg I2C_EVENT_SLAVE_TRANSMITTER_ADDRESS_MATCHED           : EV1
 *     @arg I2C_EVENT_SLAVE_RECEIVER_ADDRESS_MATCHED              : EV1
 *     @arg I2C_EVENT_SLAVE_GENERALCALLADDRESS_MATCHED            : EV1
 *     @arg I2C_EVENT_SLAVE_BYTE_RECEIVED                         : EV2
 *     @arg (I2C_EVENT_SLAVE_BYTE_RECEIVED | I2C_FLAG_GENCALL)    : EV2
 *     @arg I2C_EVENT_SLAVE_BYTE_TRANSMITTED                      : EV3
 *     @arg (I2C_EVENT_SLAVE_BYTE_TRANSMITTED | I2C_FLAG_GENCALL) : EV3
 *     @arg I2C_EVENT_SLAVE_ACK_FAILURE                           : EV3_2
 *     @arg I2C_EVENT_SLAVE_STOP_DETECTED                         : EV4
 *     @arg I2C_EVENT_MASTER_MODE_SELECT                          : EV5
 *     @arg I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED            : EV6
 *     @arg I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED               : EV6
 *     @arg I2C_EVENT_MASTER_BYTE_RECEIVED                        : EV7
 *     @arg I2C_EVENT_MASTER_BYTE_TRANSMITTING                    : EV8
 *     @arg I2C_EVENT_MASTER_BYTE_TRANSMITTED                     : EV8_2
 *     @arg I2C_EVENT_MASTER_MODE_ADDRESS10                       : EV9
 *
 * @note: For detailed description of Events, please refer to section
 *    I2C_Events in stm8s_i2c.h file.
 *
 * @retval An ErrorStatus enumeration value:
 * - SUCCESS: Last event is equal to the I2C_EVENT
 * - ERROR: Last event is different from the I2C_EVENT
 */
inline ErrorStatus I2C_CheckEvent_inline(I2C_Event_TypeDef I2C_Event) {
  __IO uint16_t lastevent = 0x00;
  uint8_t flag1 = 0x00;
  uint8_t flag2 = 0x00;
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_I2C_EVENT_OK(I2C_Event));

  if (I2C_Event == I2C_EVENT_SLAVE_ACK_FAILURE) {
    lastevent = I2C->SR2 & I2C_SR2_AF;
  } else {
    flag1 = I2C->SR1;
    flag2 = I2C->SR3;
    lastevent = ((uint16_t)((uint16_t)flag2 << (uint16_t)8) | (uint16_t)flag1);
  }
  /* Check whether the last event is equal to I2C_EVENT */
  if (((uint16_t)lastevent & (uint16_t)I2C_Event) == (uint16_t)I2C_Event) {
    /* SUCCESS: last event is equal to I2C_EVENT */
    status = SUCCESS;
  } else {
    /* ERROR: last event is different from I2C_EVENT */
    status = ERROR;
  }

  /* Return status */
  return status;
}

/**
 *
 *  2) Advanced state monitoring
 *******************************************************************************
 */
/**
 * @brief  Returns the last I2C Event.
 *
 * @note: For detailed description of Events, please refer to section
 *    I2C_Events in stm8s_i2c.h file.
 *
 * @retval The last event
 *   This parameter can be any of the  @ref I2C_Event_TypeDef enumeration.
 */
inline I2C_Event_TypeDef I2C_GetLastEvent_inline(void) {
  __IO uint16_t lastevent = 0;
  uint16_t flag1 = 0;
  uint16_t flag2 = 0;

