2rtfm/stm8s103-sdcc-xmake/lib/spl_split/inc/inline/stm8s_i2c_inline.h
  if ((I2C->SR2 & I2C_SR2_AF) != 0x00) {
    lastevent = I2C_EVENT_SLAVE_ACK_FAILURE;
  } else {
    /* Read the I2C status register */
    flag1 = I2C->SR1;
    flag2 = I2C->SR3;

    /* Get the last event value from I2C status register */
    lastevent = ((uint16_t)((uint16_t)flag2 << 8) | (uint16_t)flag1);
  }
  /* Return status */
  return (I2C_Event_TypeDef)lastevent;
}

/**
 *
 *  3) Flag-based state monitoring
 *******************************************************************************
 */
/**
 * @brief  Checks whether the specified I2C flag is set or not.
 * @param  I2C_Flag: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg I2C_FLAG_GENERALCALL: General call header flag (Slave mode)
 *     @arg I2C_FLAG_TRANSMITTERRECEIVER: Transmitter/Receiver flag
 *     @arg I2C_FLAG_BUSBUSY: Bus busy flag
 *     @arg I2C_FLAG_MASTERSLAVE: Master/Slave flag
 *     @arg I2C_FLAG_WAKEUPFROMHALT: Wake up from HALT flag
 *     @arg I2C_FLAG_OVERRUNUNDERRUN: Overrun/Underrun flag (Slave mode)
 *     @arg I2C_FLAG_ACKNOWLEDGEFAILURE: Acknowledge failure flag
 *     @arg I2C_FLAG_ARBITRATIONLOSS: Arbitration lost flag (Master mode)
 *     @arg I2C_FLAG_BUSERROR: Bus error flag
 *     @arg I2C_FLAG_TXEMPTY: Data register empty flag (Transmitter)
 *     @arg I2C_FLAG_RXNOTEMPTY: Data register not empty (Receiver) flag
 *     @arg I2C_FLAG_STOPDETECTION: Stop detection flag (Slave mode)
 *     @arg I2C_FLAG_HEADERSENT: 10-bit header sent flag (Master mode)
 *     @arg I2C_FLAG_TRANSFERFINISHED: Byte transfer finished flag
 *     @arg I2C_FLAG_ADDRESSSENTMATCHED: Address sent flag (Master mode) “ADSL”
 *   Address matched flag (Slave mode)”ENDAD”
 *     @arg I2C_FLAG_STARTDETECTION: Start bit flag (Master mode)
 * @retval The new state of I2C_FLAG (SET or RESET).
 */
inline FlagStatus I2C_GetFlagStatus_inline(I2C_Flag_TypeDef I2C_Flag) {
  uint8_t tempreg = 0;
  uint8_t regindex = 0;
  FlagStatus bitstatus = RESET;

  /* Check the parameters */
  assert_param(IS_I2C_FLAG_OK(I2C_Flag));

  /* Read flag register index */
  regindex = (uint8_t)((uint16_t)I2C_Flag >> 8);
  /* Check SRx index */
  switch (regindex) {
    /* Returns whether the status register to check is SR1 */
  case 0x01:
    tempreg = (uint8_t)I2C->SR1;
    break;

    /* Returns whether the status register to check is SR2 */
  case 0x02:
    tempreg = (uint8_t)I2C->SR2;
    break;

    /* Returns whether the status register to check is SR3 */
  case 0x03:
    tempreg = (uint8_t)I2C->SR3;
    break;

  default:
    break;
  }

  /* Check the status of the specified I2C flag */
  if ((tempreg & (uint8_t)I2C_Flag) != 0) {
    /* Flag is set */
    bitstatus = SET;
  } else {
    /* Flag is reset */
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

/**
 * @brief  Clear flags
 * @param  I2C_FLAG : Specifies the flag to clear
 *   This parameter can be any combination of the following values:
 *                       - I2C_FLAG_WAKEUPFROMHALT: Wakeup from Halt
 *                       - I2C_FLAG_OVERRUNUNDERRUN: Overrun/Underrun flag
 * (Slave mode)
 *                       - I2C_FLAG_ACKNOWLEDGEFAILURE: Acknowledge failure flag
 *                       - I2C_FLAG_ARBITRATIONLOSS: Arbitration lost flag
 * (Master mode)
 *                       - I2C_FLAG_BUSERROR: Bus error flag.
 * @note Notes:
 *                       - STOPF (STOP detection) is cleared by software
 *                         sequence: a read operation to I2C_SR1 register
 *                         (I2C_GetFlagStatus()) followed by a write operation
 *                         to I2C_CR2 register.
 *                       - ADD10 (10-bit header sent) is cleared by software
 *                         sequence: a read operation to I2C_SR1
 *                         (I2C_GetFlagStatus()) followed by writing the
 *                         second byte of the address in DR register.
 *                       - BTF (Byte Transfer Finished) is cleared by software
 *                         sequence: a read operation to I2C_SR1 register
 *                         (I2C_GetFlagStatus()) followed by a read/write to
 *                         I2C_DR register (I2C_SendData()).
 *                       - ADDR (Address sent) is cleared by software sequence:
 *                         a read operation to I2C_SR1 register
 *                         (I2C_GetFlagStatus()) followed by a read operation to
 *                         I2C_SR3 register ((void)(I2C->SR3)).
 *                       - SB (Start Bit) is cleared software sequence: a read
 *                         operation to I2C_SR1 register (I2C_GetFlagStatus())
 *                         followed by a write operation to I2C_DR register
 *                         (I2C_SendData()).
 * @retval None
 */
inline void I2C_ClearFlag_inline(I2C_Flag_TypeDef I2C_FLAG) {
  uint16_t flagpos = 0;
  /* Check the parameters */
  assert_param(IS_I2C_CLEAR_FLAG_OK(I2C_FLAG));

  /* Get the I2C flag position */
  flagpos = (uint16_t)I2C_FLAG & FLAG_Mask;
  /* Clear the selected I2C flag */
  I2C->SR2 = (uint8_t)((uint16_t)(~flagpos));
}

/**
 * @brief  Checks whether the specified I2C interrupt has occurred or not.
 * @param  I2C_ITPendingBit: specifies the interrupt source to check.
 *            This parameter can be one of the following values:
 *               - I2C_ITPENDINGBIT_WAKEUPFROMHALT: Wakeup from Halt
 *               - I2C_ITPENDINGBIT_OVERRUNUNDERRUN: Overrun/Underrun flag
 * (Slave mode)
 *               - I2C_ITPENDINGBIT_ACKNOWLEDGEFAILURE: Acknowledge failure flag
 *               - I2C_ITPENDINGBIT_ARBITRATIONLOSS: Arbitration lost flag
 * (Master mode)
 *               - I2C_ITPENDINGBIT_BUSERROR: Bus error flag
 *               - I2C_ITPENDINGBIT_TXEMPTY: Data register empty flag
 * (Transmitter)
 *               - I2C_ITPENDINGBIT_RXNOTEMPTY: Data register not empty
 * (Receiver) flag
 *               - I2C_ITPENDINGBIT_STOPDETECTION: Stop detection flag (Slave
 * mode)
 *               - I2C_ITPENDINGBIT_HEADERSENT: 10-bit header sent flag (Master
 * mode)
 *               - I2C_ITPENDINGBIT_TRANSFERFINISHED: Byte transfer finished
 * flag
 *               - I2C_ITPENDINGBIT_ADDRESSSENTMATCHED: Address sent flag
 * (Master mode) “ADSL” Address matched flag (Slave mode)“ENDAD”
 *               - I2C_ITPENDINGBIT_STARTDETECTION: Start bit flag (Master mode)
 * @retval The new state of I2C_ITPendingBit
 *   This parameter can be any of the @ref ITStatus enumeration.
 */
inline ITStatus
I2C_GetITStatus_inline(I2C_ITPendingBit_TypeDef I2C_ITPendingBit) {
  ITStatus bitstatus = RESET;
  __IO uint8_t enablestatus = 0;
  uint16_t tempregister = 0;

  /* Check the parameters */
  assert_param(IS_I2C_ITPENDINGBIT_OK(I2C_ITPendingBit));

  tempregister =
      (uint8_t)(((uint16_t)((uint16_t)I2C_ITPendingBit & ITEN_Mask)) >> 8);

  /* Check if the interrupt source is enabled or not */
  enablestatus = (uint8_t)(I2C->ITR & (uint8_t)tempregister);

  if ((uint16_t)((uint16_t)I2C_ITPendingBit & REGISTER_Mask) ==
      REGISTER_SR1_Index) {
    /* Check the status of the specified I2C flag */
    if (((I2C->SR1 & (uint8_t)I2C_ITPendingBit) != RESET) && enablestatus) {
      /* I2C_IT is set */
      bitstatus = SET;
    } else {
      /* I2C_IT is reset */
      bitstatus = RESET;
    }
  } else {
    /* Check the status of the specified I2C flag */
    if (((I2C->SR2 & (uint8_t)I2C_ITPendingBit) != RESET) && enablestatus) {
      /* I2C_IT is set */
      bitstatus = SET;
    } else {
      /* I2C_IT is reset */
      bitstatus = RESET;
    }
  }
  /* Return the I2C_IT status */
  return bitstatus;
}

/**
 * @brief  Clear IT pending bit
 * @param  I2C_ITPendingBit : specifies the interrupt pending bit to clear.
 *            This parameter can be any combination of the following values:
 *                 - I2C_ITPENDINGBIT_WAKEUPFROMHALT: Wakeup from Halt
 *                 - I2C_ITPENDINGBIT_OVERRUNUNDERRUN: Overrun/Underrun
 * interrupt (Slave mode)
 *                 - I2C_ITPENDINGBIT_ACKNOWLEDGEFAILURE: Acknowledge failure
 * interrupt
 *                 - I2C_ITPENDINGBIT_ARBITRATIONLOSS: Arbitration lost
 * interrupt (Master mode)
 *                 - I2C_ITPENDINGBIT_BUSERROR: Bus error interrupt
 *
 *             Notes:
 *                  - STOPF (STOP detection) is cleared by software
 *                    sequence: a read operation to I2C_SR1 register
 *                    (I2C_GetITStatus()) followed by a write operation to
 *                    I2C_CR2 register (I2C_AcknowledgeConfig() to configure
 *                    the I2C peripheral Acknowledge).
 *                  - ADD10 (10-bit header sent) is cleared by software
 *                    sequence: a read operation to I2C_SR1
 *                    (I2C_GetITStatus()) followed by writing the second
 *                    byte of the address in I2C_DR register.
 *                  - BTF (Byte Transfer Finished) is cleared by software
 *                    sequence: a read operation to I2C_SR1 register
 *                    (I2C_GetITStatus()) followed by a read/write to
 *                    I2C_DR register (I2C_SendData()).
 *                  - ADDR (Address sent) is cleared by software sequence:
 *                    a read operation to I2C_SR1 register (I2C_GetITStatus())
 *                    followed by a read operation to I2C_SR3 register
 *                    ((void)(I2C->SR3)).
 *                  - SB (Start Bit) is cleared by software sequence: a
 *                    read operation to I2C_SR1 register (I2C_GetITStatus())
 *                    followed by a write operation to I2C_DR register
 *                    (I2C_SendData()).
 * @retval None
 */
inline void
I2C_ClearITPendingBit_inline(I2C_ITPendingBit_TypeDef I2C_ITPendingBit) {
  uint16_t flagpos = 0;

  /* Check the parameters */
  assert_param(IS_I2C_CLEAR_ITPENDINGBIT_OK(I2C_ITPendingBit));

  /* Get the I2C flag position */
  flagpos = (uint16_t)I2C_ITPendingBit & FLAG_Mask;

  /* Clear the selected I2C flag */
  I2C->SR2 = (uint8_t)((uint16_t)~flagpos);
}

#endif
